app/views/users/show.html.erb

<p>Personal Garden: </p>
<% @trainer.gardens.each do |garden| %>
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."user_id" = 8