app/controllers/gardens_controller.rb

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."garden_id" = 1
SELECT SUM() FROM "plants" WHERE "plants"."garden_id" = 2
---
  def show
    @garden = Garden.find(params[:id])
    @plants = Plant.where(garden:@garden)