app/controllers/plants_controller.rb

INSERT INTO "plants" ("created_at", "updated_at", "ndex", "garden_id") VALUES (?, ?, ?, ?)  [["created_at", "2018-04-27 01:21:18.018359"], ["updated_at", "2018-04-27 01:21:18.018359"], ["ndex", 1], ["garden_id", 2]]
---
  def create
  	plant = Plant.create(plant_params)