app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "community_gardens".* FROM "community_gardens"
SELECT "gardens".* FROM "gardens"
---
  def show
    @user = User.find(params[:id])
    @gardens = Garden.where(user: current_user)
    @community_gardens = CommunityGarden.all # need to change this to include all users who are part of the community garden